#### AnalyticalNodeData Members

---

|  |
| --- |
| AnalyticalNodeData Class   Methods   Properties   See Also |

The  AnalyticalNodeData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  AnalyticalNodeData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method Static member | GetAnalyticalNodeData | Returns AnalyticalNodeData associated with this element, if it exists. |
| Public method | GetConnectionStatus | Returns the Connection Status for this Analytical Node. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

AnalyticalNodeData Class

Autodesk.Revit.DB.Structure Namespace